# IndexPoint Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexPoint Constructor
IndexPoint Class See Also
---
Constructs the point primitive.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IndexPoint(
	int index
)
```

Visual Basic
---
```text
Public Sub New ( _
	index As Integer _
)
```

Visual C++
---
```text
public:
IndexPoint(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the point's vertex.
# See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace